#+title: Procedures, Recursion, and Memory
#+subtitle: Efficiency of Memory Allocation
#+author: Franck Chauvel
#+language: en

#+SETUPFILE: ../templates/style.org


** Recursion

   #+name: code:factorial
   #+begin_src C
     #include <stdio.h>

     long factorial(int value) {
       long product = 1;
       for(int each=2 ; each <= value ; each++) {
           product = product * each;
       }
       return product;
     }

     int main() {
        printf("5! = %d\n", factorial(5));
     }
   #+end_src

   #+RESULTS: code:factorial
   : 5! = 120


   #+name: code:factorial-recursive
   #+begin_src C
     #include <stdio.h>

     long factorial(int value) {
       if (value == 0) return 1;
       return value * factorial(value-1);
     }

     int main() {
        printf("5! = %d\n", factorial(5));
     }
   #+end_src

   #+RESULTS: code:factorial-recursive
   : 5! = 120
   
